{
    "et": {
        "header": {
            "title": "Portfoolio"
        },
        "LinkedIn": {
            "description": "Tudeng TalTechist - Tallinn Tehnika Ülikool | Oskan kasutada: C#, JavaScript, React JS, GitHub, HTML&CSS",
            "LinkedInButton": "Vaata Profiili",
            "CVButton": "Vaata CV-d",
            "Programming": "Oskused:",
            "Software": "Tarkvara:"
        },
        "content": {
            "title": "Minu tööd:",
            "button": "VAATA\\nPROJEKTI",
            "project_1_title": "1# Projekt",
            "project_1_content": "\"Praktikakohviku veebileht\"\\nSain 2022 aastal panna end proovile TalTechi IT Teaduskonna Õliõpilaskogu poolt korraldatud üritusega nagu Praktikakohvik. Olin ürituse peakorraldaja ning veebiarendaja.",
            "Praktikakohvik2022": "Sain võimaluse 2022 aastal olla TalTechi ürituse Praktikakohvik projekti juht, kus tegelesin nii disaini, juhtimise kui ka veebiarendusega. Eesmärk oli luua lihtne ning mugav üheleheline interaktiivne veebileht.\\n\\nSelle veebilehe jaoks tahtsin ma panna end eriti proovile ning võtsin esmakordselt kasutusele React JS-i. Kasutades varasemaid teadmisi sain ma HTML ning CSS koodiga hästi hakkama. React pakkus uusi võimalusi koodi puhtamana hoidmiseks ja sorteerimiseks. Kasutades Hook-i useContext sain ma mugava viisi lokaliseerida veebileht. Andmete hoiustamiseks kasutasin JSON faili, kus olid nii inglise kui ka eestikeelsed terminid. Suureks abiks olid ka useState ja useEffect, millega sai veebilehe interaktiivseks muuta. Lisaks kasutasin JavaScript DOM-i, et muuta HTML elemntide stiile ja sisu.",
            "project_2_title": "2# Projekt",
            "project_2_content": "\"KG Lan 2019 veebileht & rakendus\"\\nMinu esimene suur IT projekt oli kui ma tegin oma esimese veebilehe ja rakenduse suurele LAN üritusele, mida ma ise korraldasin. Ei teadnud koodimisest veel midagi, kuid olin nii sihikindel ning ei andnud alla.",
            "KGLan2019": "KG Lan 2019 veebileht oli esimene veebileht, mida ma arendasin. Eesmärk oli kasutada ainult HTML-i ja CSS-i, sest igasugused pistiprogrammid oleksid teinud selle lihtsa staatilise lehekülje keeruliseks ning ma teadsin, et algul tuleb selgeks õppida baasoskused.\\n\\nAlustuseks lõin disaini koos põhi elementidega. Koodi kirjutamisel proovisin kindlate eesmärkide jaoks kasutada õigeid HTML Tag-e ning kirjutada selgeid klassi ja id nimetusi, et CSS oleks kergemini loetav. Kui kood oli valmis, hakkasin lahedaid efekte katsetama (sujuv kerimine, hover/focus).\\n\\nRakenduse jaoks kasutasin ma block koodimist MIT App Inventoris. Selleks et otseülekandel näidata rakenduses tehtud muudatusi, pidin leidma viisi, kuidas saada info telefonist .txt faili, kust OBS Studio seda loeks. MIT rakendusest oli hästi keeruline infot kuhugi edastada, kuid leidsin selle jaoks huvitava lahenduse. Seade saatis pärast igat muudatust Google Formsiga info Google Sheetsi. Koos Google Apps Scriptiga sain ma kõik Sheetsi andmed puhta tekstina eraldi veebilehele, kus arvutis olev Pythoni skript seda luges ning .txt faili kirjutas.\\n\\nSelle projektiga sain ma oma nahal tunda, kui oluline on puhta koodi säilitamine. Selle saavutamisel ja hoidmisel oli uute elementide lisamine hästi kerge ja mugav. Lisaks arendas see meeletult minu probleemide leidmise ja lahendamise oskust. Vaadates tagasi näen kui palju paremini ma oleks saanud seda koodi kirjutada."
        }
    },
    "en": {
        "header": {
            "title": "Portfolio"
        },
        "LinkedIn": {
            "description": "Student at TalTech - Tallinn University of Technology | Experienced with: C#, JavaScript, React JS, GitHub, HTML&CSS",
            "LinkedInButton": "View Profile",
            "CVButton": "View CV",
            "Programming": "Skills:",
            "Software": "Software:"
        },
        "content": {
            "title": "My work:",
            "button": "VIEW\\nPROJECT",
            "project_1_title": "1# Project",
            "project_1_content": "\"Internship Café Website\"\\nThis year I got to but myself to the test with an event in TalTech, such as the Internship Café. I was the main organizer of the event and the web developer.",
            "Praktikakohvik2022": "In 2022, I had the opportunity to be the project manager of the TalTech event Internship Café, where I was involved in design, management and web development. The goal was to create a simple and convenient single-page interactive website.\\n\\nFor this website, I wanted to put myself to the test and used React JS for the first time. Using previous knowledge, writing HTML and CSS went smoothly. React offered new ways to keep the code cleaner and sorted. Using the useContext Hook, I was able to conveniently localize the website. I used a JSON file with both English and Estonian terms to store the data. UseState and useEffect were also a great help in making the website interactive. In addition, I used the JavaScript DOM to change the styles and content of HTML elements.",
            "project_2_title": "2# Project",
            "project_2_content": "\"KG Lan 2019 Website\"\\nMy first big IT project was when I made my first website and application for a big LAN event I organized myself. I didn't know anything about coding yet, but I was so determined not to give up.",
            "KGLan2019": "The KG Lan 2019 website was the first ever website I developed. The goal was to only use HTML and CSS, because any plug-in would have made this simple static page complicated and I had to learn the fundamentals first.\\n\\nFor starters, I created a design with basic elements. When writing the code, I tried to correctly use HTML Tags and write clear class and id names to make the CSS easier to read. When the code was ready, I started experimenting with cool effects (smooth scrolling, hover/focus).\\n\\nFor the application, I used block coding in the MIT App Inventor. In order to show the changes made on the application appear on the livestream, I had to find a way to get the information from the phone to a .txt file from which OBS Studio would read it. It was very difficult to transfer information from the MIT application, but I came up with a interesting solution. With the help of Google Forms the device sent information to Google Sheets by submitting a form. Along with Google Apps Script, I got all of the Sheets data in plain text on a separate web page where a Python script on my computer read it and wrote the .txt file.\\n\\nWith this project, I learned the hard way why clean code is so important. Maintaining clean code made it convenient and easy to add new elements. In addition, it substantially developed my ability to find and solve problems. Looking back I can see how much better I could have written this code."
        }
    }
}
